Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer
The Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer class provides the service for drawing graphics.
Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer

Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.graphics
The graphics context.

Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.coordinateSystem
The coordinate system.

Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.#ctor(Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsContext)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer class.
graphics: The graphics.

Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.Dispose


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.Clear


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawArc(Tekla.Structures.Geometry3d.Arc,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawCircle(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawLine(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawLines(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.LineSegment},Tekla.Structures.Plugins.DirectManipulation.Services.LineType)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawDimension(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Plugins.DirectManipulation.Services.DimensionEndPointSizeType)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawFace(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Plugins.DirectManipulation.Services.SurfaceType,System.Boolean)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawText(System.String,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Plugins.DirectManipulation.Services.TextRepresentationTypes)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawProfile(System.String,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawShape(System.String,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawCustomPart(System.String,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawExtrema(Tekla.Structures.Geometry3d.AABB,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.DrawExtrema(Tekla.Structures.Geometry3d.LineSegment,System.Double,System.Double,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)


Tekla.Structures.Plugins.DirectManipulation.Internal.GraphicsDrawer.GetRotationAngle(Tekla.Structures.Geometry3d.LineSegment,System.Double)
Gets the proper rotation angle of the graphic based on the direction and initialRotationInDegrees.
direction: The direction.
initialRotationInDegrees: The initial rotation in degrees.
Returns:
The rotation angle.